/******************** (C) COPYRIGHT 2016 UPRE Team ***************************
 * 文件名  ：LED.c
 * 描述    ：LED灯 应用函数库         
 * 实验平台：STC51单片机
 * 硬件连接：------------------
 *          |   P1^0 - LED0    |
 *          |   P1^1 - LED1    |
 *          |   P1^2 - LED2    |
 *          |   P1^3 - LED3    |
 *          |   P1^4 - LED4    |
 *          |   P1^5 - LED5    |
 *          |   P1^6 - LED6    |	
 *          |   P1^7 - LED7    |	 
 *           ----------------- 
**********************************************************************************/

#include "LED.h"
#include "delay.h"

/*
 * 函数名：LED_FLASH
 * 描述  ：流水灯驱动
 * 输入  ：无
 * 输出  ：无
 */

void LED_FLASH(void)
{
	  unsigned char i;
	  P1=0xfe;			  /*(1)正向依次亮*/
	  for(i=0;i<8;i++)
	  {
	       delay(200);
	       P1<<=1;
	       P1=P1|0x01;
	  }
}

